Revit 2027 API
StairsType.ConstructionMethod Property
 The construction method of the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StairsConstructionMethod ConstructionMethod { get; }
Public ReadOnly Property ConstructionMethod As StairsConstructionMethod
	Get
public:
property StairsConstructionMethod ConstructionMethod {
	StairsConstructionMethod get ();
}
member ConstructionMethod : StairsConstructionMethod with get
Property Value
StairsConstructionMethod
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace